In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# pandas的数据结构介绍
## Series

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5,3], index = ['d', 'a', 'b', 'c'])

In [7]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'a', u'b', u'c'], dtype='object')

In [9]:
obj2['a']

7

In [10]:
obj2[['a', 'b', 'c']]

a    7
b   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
a    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
a    14
b   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
a    1096.633158
b       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'g' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 15000, 'Utah': 5000}

In [17]:
obj3 = Series(sdata)

In [18]:
obj3

Ohio      35000
Oregon    15000
Texas     71000
Utah       5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Texas', 'Oregon']

In [20]:
obj4 = Series(sdata, index = states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [25]:
obj4.notnull()

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         30000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'population'
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
Name: population, dtype: float64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [31]:
data = {'States': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'population': [1.5, 1.6, 3.6, 2.4, 2.7]}
frame = DataFrame(data)

In [32]:
frame

   States  population  year
0    Ohio         1.5  2000
1    Ohio         1.6  2001
2    Ohio         3.6  2002
3  Nevada         2.4  2001
4  Nevada         2.7  2002

In [33]:
DataFrame(data, columns = ['year', 'States', 'population'])

   year  States  population
0  2000    Ohio         1.5
1  2001    Ohio         1.6
2  2002    Ohio         3.6
3  2001  Nevada         2.4
4  2002  Nevada         2.7

In [34]:
frame2 = DataFrame(data, columns = ['year', 'States', 'population', 'debt'], index = ['One', 'Two', 'Three', 'Four', 'Five'])

In [35]:
frame2

       year  States  population debt
One    2000    Ohio         1.5  NaN
Two    2001    Ohio         1.6  NaN
Three  2002    Ohio         3.6  NaN
Four   2001  Nevada         2.4  NaN
Five   2002  Nevada         2.7  NaN

In [36]:
frame2.columns

Index([u'year', u'States', u'population', u'debt'], dtype='object')

In [37]:
frame2['States']

One        Ohio
Two        Ohio
Three      Ohio
Four     Nevada
Five     Nevada
Name: States, dtype: object

In [38]:
frame2.year

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Name: year, dtype: int64

In [39]:
frame2.ix['Three']

year          2002
States        Ohio
population     3.6
debt           NaN
Name: Three, dtype: object

In [40]:
frame2['debt'] = 16.5

In [41]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5  16.5
Two    2001    Ohio         1.6  16.5
Three  2002    Ohio         3.6  16.5
Four   2001  Nevada         2.4  16.5
Five   2002  Nevada         2.7  16.5

In [42]:
frame2['debt'] = np.arange(5.)

In [43]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5   0.0
Two    2001    Ohio         1.6   1.0
Three  2002    Ohio         3.6   2.0
Four   2001  Nevada         2.4   3.0
Five   2002  Nevada         2.7   4.0

In [44]:
val = Series([-1.2, -1.5, -1.7], index = ['One', 'Three', 'Five'])

In [45]:
frame2['Val'] = val

In [46]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [47]:
frame2['Eastern'] = (frame2.States == 'Nevada')

In [48]:
frame2

       year  States  population  debt  Val Eastern
One    2000    Ohio         1.5   0.0 -1.2   False
Two    2001    Ohio         1.6   1.0  NaN   False
Three  2002    Ohio         3.6   2.0 -1.5   False
Four   2001  Nevada         2.4   3.0  NaN    True
Five   2002  Nevada         2.7   4.0 -1.7    True

In [49]:
del frame2['Eastern']

In [50]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [51]:
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
frame3 = DataFrame(pop)

In [53]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [56]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [57]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [58]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [59]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [60]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [61]:
frame2.values

array([[2000, 'Ohio', 1.5, 0.0, -1.2],
       [2001, 'Ohio', 1.6, 1.0, nan],
       [2002, 'Ohio', 3.6, 2.0, -1.5],
       [2001, 'Nevada', 2.4, 3.0, nan],
       [2002, 'Nevada', 2.7, 4.0, -1.7]], dtype=object)

## 索引对象

In [62]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [63]:
index = obj.index

In [64]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [65]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [66]:
#index[1] = 'd'

In [67]:
index = pd.Index(np.arange(3))

In [68]:
obj2 = Series([1.5, -2.5, 0], index = index)

In [69]:
obj2.index is index

True

In [70]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
'Ohio' in frame3.columns

True

In [72]:
2003 in frame3.index

False

# 基本功能
## 重新索引

In [73]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [74]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [75]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])

In [76]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [77]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [78]:
obj3 = Series(['Blue', 'Purple', 'Yellow'], index = [0, 2, 4])

In [79]:
obj3.reindex(range(6), method = 'ffill')

0      Blue
1      Blue
2    Purple
3    Purple
4    Yellow
5    Yellow
dtype: object

In [80]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [81]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [83]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [84]:
state = ['Texas', 'Calfornia', 'Utah']
frame.reindex(columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [85]:
frame.reindex(index = ['a', 'b', 'c', 'd'], method = 'ffill', columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
b      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [86]:
frame.ix[['a', 'b', 'c', 'd'], state]

   Texas  Calfornia  Utah
a    1.0        NaN   NaN
b    NaN        NaN   NaN
c    4.0        NaN   NaN
d    7.0        NaN   NaN

## 丢弃指定轴上的项

In [87]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [88]:
new_obj = obj.drop('c')

In [89]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj.drop(['a', 'e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [91]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns = ['one', 'two', 'three', 'four'])

In [92]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop(['Colorado', 'New York'])

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [94]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [95]:
data.drop(['one', 'two'], axis = 1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

## 索引，选取和过滤

In [96]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [97]:
obj['b']

1.0

In [98]:
obj[1]

1.0

In [99]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [100]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [101]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [102]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [103]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [104]:
obj['b':'d'] = 5

In [105]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [106]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns = ['one', 'two', 'three', 'four'])

In [107]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [109]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [110]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [111]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [113]:
data[data < 5] = 0

In [114]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [116]:
data.ix[['Colorado', 'New York'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
New York    15   12   13

In [117]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [118]:
data.ix[: 'Colorado', 'two']

Ohio        0
Colorado    5
Name: two, dtype: int64

In [119]:
data.ix[data.three > 5, : 3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 算术运算和数据对齐

In [120]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [121]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [122]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'), index = ['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [123]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## 在算术方法中填充值

In [124]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns = list('abcde'))

In [125]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [126]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [128]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [129]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## DataFrame和Series之间的运算

In [130]:
arr = np.arange(12.).reshape((3, 4))

In [131]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [132]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [133]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [134]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), 
                  columns = list('bde'), 
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [135]:
series = frame.ix[0]

In [136]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [137]:
series2 = Series(range(3), index = ['b', 'e', 'f'])

In [138]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [139]:
series3 = frame['d']

In [140]:
frame.sub(series3, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# 函数应用和映射

In [141]:
frame = DataFrame(np.random.randn(4, 3), columns = list('bde'), 
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [142]:
frame

               b         d         e
Utah   -0.458069  0.667333  1.469488
Ohio   -0.611519 -1.251484  0.518791
Texas  -0.354400 -2.338141  0.665740
Oregon  0.367568  0.932535  0.173931

In [143]:
np.abs(frame)

               b         d         e
Utah    0.458069  0.667333  1.469488
Ohio    0.611519  1.251484  0.518791
Texas   0.354400  2.338141  0.665740
Oregon  0.367568  0.932535  0.173931

In [144]:
f = lambda x: x.max() - x.min()

In [145]:
frame.apply(f)

b    0.979087
d    3.270677
e    1.295557
dtype: float64

In [146]:
frame.apply(f, axis = 1)

Utah      1.927557
Ohio      1.770275
Texas     3.003881
Oregon    0.758604
dtype: float64

In [147]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

In [148]:
frame.apply(f)

            b         d         e
min -0.611519 -2.338141  0.173931
max  0.367568  0.932535  1.469488

In [149]:
format = lambda x: '%.2f' % x

In [150]:
frame.applymap(format)

            b      d     e
Utah    -0.46   0.67  1.47
Ohio    -0.61  -1.25  0.52
Texas   -0.35  -2.34  0.67
Oregon   0.37   0.93  0.17

In [151]:
frame['e'].map(format)

Utah      1.47
Ohio      0.52
Texas     0.67
Oregon    0.17
Name: e, dtype: object

## 排序和排名

In [152]:
obj = Series(range(4), index = ['d', 'a', 'b', 'c'])

In [153]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [154]:
frame = DataFrame(np.arange(8.).reshape((2, 4)), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [155]:
frame

         d    a    b    c
three  0.0  1.0  2.0  3.0
one    4.0  5.0  6.0  7.0

In [156]:
frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [157]:
frame.sort_index(axis = 1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [158]:
frame.sort_index(axis = 1, ascending = False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [159]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [160]:
obj.order()

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [161]:
frame = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})

In [162]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [163]:
frame.sort_index(by='b')

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [164]:
frame.sort_index(by = ['a', 'b'])

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [165]:
obj = Series([7,-5,7,4,2,0,4])

In [166]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [167]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [168]:
obj.rank(method = 'max', ascending = False)

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [169]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [170]:
frame.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## 带有重复值的轴索引

In [171]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [172]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [173]:
obj.index.is_unique

False

In [174]:
obj['a']

a    0
a    1
dtype: int64

In [175]:
obj['c']

4

In [176]:
df = DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])

In [177]:
df

          0         1         2
a -0.436334 -0.570318  2.883859
a  0.117182 -0.941523  0.271615
b -1.011514 -1.707310 -1.734092
b -0.375219  0.354667  1.230747

In [178]:
df.ix['b']

          0         1         2
b -1.011514 -1.707310 -1.734092
b -0.375219  0.354667  1.230747

## 汇总和计算描述统计

In [179]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index = ['a', 'b', 'c', 'd'],
              columns = ['one', 'two'])

In [180]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [181]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [182]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [183]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [184]:
df.idxmax()

one    b
two    d
dtype: object

In [185]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [186]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [187]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [188]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 相关系数和协方差

In [189]:
import pandas_datareader.data as web

In [190]:
all_data = dict()
for ticker in ['AAPL', 'IBM']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2014', '1/1/2015')
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [191]:
returns = price.pct_change()

In [192]:
returns

                AAPL       IBM
Date
2014-01-02       NaN       NaN
2014-01-03 -0.021966  0.005983
2014-01-06  0.005453 -0.003429
2014-01-07 -0.007152  0.019946
2014-01-08  0.006333 -0.009172
2014-01-09 -0.012770 -0.003139
2014-01-10 -0.006673 -0.000640
2014-01-13  0.005235 -0.016554
2014-01-14  0.019898  0.009557
2014-01-15  0.020077  0.009789
2014-01-16 -0.005580  0.005433
2014-01-17 -0.024502  0.007046
2014-01-21  0.015536 -0.008733
2014-01-22  0.004444 -0.032797
2014-01-23  0.008468  0.002634
2014-01-24 -0.018178 -0.016910
2014-01-27  0.008113 -0.009686
2014-01-28 -0.079927 -0.005902
2014-01-29 -0.011352 -0.002545
2014-01-30 -0.001937  0.005442
2014-01-31  0.001641 -0.003834
2014-02-03  0.001858 -0.021395
2014-02-04  0.014476 -0.000347
2014-02-05  0.007469  0.008100
2014-02-06  0.005829  0.007963
2014-02-07  0.013990  0.014771
2014-02-10  0.017915 -0.000621
2014-02-11  0.013176  0.014452
2014-02-12 -0.000075  0.003005
2014-02-13  0.015879  0.008877
...              ...       ...
2014-11-18  0.012984 -0.013828
2014-11-19 -0.006928 -0.002841
2014-11-20  0.014302 -0.004894
2014-11-21  0.001376  0.001743
2014-11-24  0.018546  0.007644
2014-11-25 -0.008682 -0.002405
2014-11-26  0.011905  0.001175
2014-11-28 -0.000588  0.001358
2014-12-01 -0.032456 -0.003885
2014-12-02 -0.003824  0.006995
2014-12-03  0.011341  0.011373
2014-12-04 -0.003795 -0.002857
2014-12-05 -0.004243 -0.004755
2014-12-08 -0.022609 -0.008636
2014-12-09  0.015303  0.006981
2014-12-10 -0.019015 -0.015216
2014-12-11 -0.002948  0.003489
2014-12-12 -0.016932 -0.035326
2014-12-15 -0.013670 -0.014931
2014-12-16 -0.013675 -0.010780
2014-12-17  0.024918  0.003434
2014-12-18  0.029613  0.037846
2014-12-19 -0.007723  0.005264
2014-12-22  0.010378  0.018485
2014-12-23 -0.003542  0.004955
2014-12-24 -0.004709 -0.002589
2014-12-26  0.017677  0.003213
2014-12-29 -0.000702 -0.011273
2014-12-30 -0.012203 -0.002866
2014-12-31 -0.019019  0.002437

[252 rows x 2 columns]

In [193]:
returns.tail()

                AAPL       IBM
Date
2014-12-24 -0.004709 -0.002589
2014-12-26  0.017677  0.003213
2014-12-29 -0.000702 -0.011273
2014-12-30 -0.012203 -0.002866
2014-12-31 -0.019019  0.002437

In [194]:
returns.IBM.corr(returns.AAPL)

0.17824684762190815

In [195]:
returns.corr()

          AAPL       IBM
AAPL  1.000000  0.178247
IBM   0.178247  1.000000

In [196]:
returns.cov()

          AAPL       IBM
AAPL  0.000186  0.000026
IBM   0.000026  0.000117

In [197]:
returns.corrwith(returns.IBM)

AAPL    0.178247
IBM     1.000000
dtype: float64

In [198]:
returns.corrwith(volume)

AAPL   -0.070174
IBM    -0.338985
dtype: float64

## 唯一值，值计数以及成员资格

In [199]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [200]:
uniques = obj.unique()

In [201]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [202]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [203]:
pd.value_counts(obj, ascending = True)

d    1
b    2
a    3
c    3
dtype: int64

In [204]:
pd.value_counts(obj.values, sort = False)

a    3
c    3
b    2
d    1
dtype: int64

In [205]:
mask = obj.isin(['b', 'c'])

In [206]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [207]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [208]:
data = DataFrame({'Qu1': [1,3,4,3,4],
                  'Qu2': [2,3,1,2,3],
                  'Qu3': [1,5,2,4,4]})

In [209]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [210]:
result = data.apply(pd.value_counts).fillna(0)

In [211]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 处理缺失数据

In [212]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [213]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [214]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [215]:
string_data[0] = None

In [216]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [217]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 滤除缺失数据

In [218]:
from numpy import nan as NA

In [219]:
data = Series([1, NA, 3.5, NA, 6])

In [220]:
data.dropna()

0    1.0
2    3.5
4    6.0
dtype: float64

In [221]:
data[data.notnull()]

0    1.0
2    3.5
4    6.0
dtype: float64

In [222]:
data = DataFrame([[1., 6.5, 3.], [1, NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3]])

In [223]:
cleaned = data.dropna()

In [224]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [225]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [226]:
data[4] = NA

In [227]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [228]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [229]:
df = DataFrame(np.random.randn(7,3))

In [230]:
df

          0         1         2
0  0.574925  0.679143 -1.413336
1 -1.878795 -0.358007  0.530273
2 -0.611507  1.964805 -0.808058
3  1.059834 -1.813585  0.260266
4  0.638658 -0.395621  0.317239
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

In [231]:
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA

In [232]:
df

          0         1         2
0  0.574925       NaN       NaN
1 -1.878795       NaN       NaN
2 -0.611507       NaN       NaN
3  1.059834       NaN  0.260266
4  0.638658       NaN  0.317239
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

In [233]:
df.dropna(thresh = 3)

          0         1         2
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

## 填充缺失数据

In [234]:
df.fillna(0)

          0         1         2
0  0.574925  0.000000  0.000000
1 -1.878795  0.000000  0.000000
2 -0.611507  0.000000  0.000000
3  1.059834  0.000000  0.260266
4  0.638658  0.000000  0.317239
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

In [235]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.574925  0.500000       NaN
1 -1.878795  0.500000       NaN
2 -0.611507  0.500000       NaN
3  1.059834  0.500000  0.260266
4  0.638658  0.500000  0.317239
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

In [236]:
_ = df.fillna(0, inplace = True)

In [237]:
df

          0         1         2
0  0.574925  0.000000  0.000000
1 -1.878795  0.000000  0.000000
2 -0.611507  0.000000  0.000000
3  1.059834  0.000000  0.260266
4  0.638658  0.000000  0.317239
5 -1.069673  0.674632  0.796519
6  1.767367  0.875624  1.845577

In [238]:
df = DataFrame(np.random.randn(6,3))

In [239]:
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA

In [240]:
df

          0         1         2
0 -0.842615  0.132708  0.735472
1  1.109803 -0.177702  0.968883
2  0.481147       NaN  0.753963
3 -0.924997       NaN -0.836070
4 -0.117060       NaN       NaN
5 -0.516068       NaN       NaN

In [241]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.842615  0.132708  0.735472
1  1.109803 -0.177702  0.968883
2  0.481147 -0.177702  0.753963
3 -0.924997 -0.177702 -0.836070
4 -0.117060 -0.177702 -0.836070
5 -0.516068 -0.177702 -0.836070

In [242]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.842615  0.132708  0.735472
1  1.109803 -0.177702  0.968883
2  0.481147 -0.177702  0.753963
3 -0.924997 -0.177702 -0.836070
4 -0.117060       NaN -0.836070
5 -0.516068       NaN -0.836070

In [243]:
data = Series([1., NA, 3.5, NA, 7])

In [244]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 层次化索引

In [245]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                           [1,2,3,1,2,3,1,2,2,3]])

In [246]:
data

a  1   -0.968745
   2    0.506077
   3   -0.484560
b  1   -0.720440
   2    1.727312
   3    0.309285
c  1   -0.237709
   2    0.422632
d  2   -0.621234
   3   -0.496183
dtype: float64

In [247]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [248]:
data['b']

1   -0.720440
2    1.727312
3    0.309285
dtype: float64

In [249]:
data['b': 'c']

b  1   -0.720440
   2    1.727312
   3    0.309285
c  1   -0.237709
   2    0.422632
dtype: float64

In [250]:
data.ix[['b', 'd']]

b  1   -0.720440
   2    1.727312
   3    0.309285
d  2   -0.621234
   3   -0.496183
dtype: float64

In [251]:
data[:, 2]

a    0.506077
b    1.727312
c    0.422632
d   -0.621234
dtype: float64

In [252]:
data.unstack()

          1         2         3
a -0.968745  0.506077 -0.484560
b -0.720440  1.727312  0.309285
c -0.237709  0.422632       NaN
d       NaN -0.621234 -0.496183

In [253]:
data.unstack().stack()

a  1   -0.968745
   2    0.506077
   3   -0.484560
b  1   -0.720440
   2    1.727312
   3    0.309285
c  1   -0.237709
   2    0.422632
d  2   -0.621234
   3   -0.496183
dtype: float64

In [254]:
frame = DataFrame(np.arange(12).reshape((4,3)), index = [['a', 'a', 'b', 'b'], [1,2,1,2]],
                 columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [255]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [256]:
frame.index.names = ['key1', 'key2']

In [257]:
frame.columns.names = ['state', 'color']

In [258]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [259]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [260]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                      names = ['State', 'Color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'State', u'Color'])

# 重排分级顺序

In [261]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [262]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [263]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# 根据级别汇总统计

In [264]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [265]:
frame.sum(level = 'color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

# 使用dataframe的列

In [266]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd': [0,1,2,0,1,2,3]})

In [267]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [268]:
frame2 = frame.set_index(['c', 'd'])

In [269]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [270]:
frame.set_index(['c', 'd'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [271]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# 其他有关pandas的话题

# 整数索引

In [272]:
ser = Series(np.arange(3.))

In [273]:
#ser[-1]

In [274]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [275]:
ser2 = Series(np.arange(3.), index = ['a', 'b', 'c'])

In [276]:
ser2[-1]

2.0

In [277]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [278]:
ser3 = Series(range(3), index = [-5, 1, 3])

In [279]:
ser3.iget_value(2)

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [280]:
frame = DataFrame(np.arange(6).reshape(3,2), index = [2,0,1])

In [281]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [282]:
frame.irow(0)

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  if __name__ == '__main__':

0    0
1    1
Name: 2, dtype: int64

# 面板数据

In [283]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
                 for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [284]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [285]:
pdata = pdata.swapaxes('items', 'minor')

In [286]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.808505  10.39902  160.499779  16.501303
2009-01-05  12.306869  10.26359  163.861421  16.655521
2009-01-06  12.103880  10.68922  166.863420  16.850323
2009-01-07  11.842336  10.78596  160.844427  15.835732
2009-01-08  12.062241  10.90204  162.432840  16.330853
2009-01-09  11.786384  10.75694  157.377899  15.843849
2009-01-12  11.536551  10.30228  156.189080  15.803264
2009-01-13  11.412936  10.40869  157.003261  16.087350
2009-01-14  11.103247   9.97338  150.334921  15.494829
2009-01-15  10.849511  10.19587  149.345914  15.616580
2009-01-16  10.712884   9.93469  149.685575  15.998066
2009-01-20  10.175483   9.52840  141.234014  14.999709
2009-01-21  10.777944   9.86697  151.388865  15.730214
2009-01-22  11.497515   9.65416  153.097158  13.887718
2009-01-23  11.497515   9.80893  162.188089  13.960769
2009-01-26  11.664070   9.97338  161.773501  14.309787
2009-01-27  11.805902   9.74122  165.574702  14.334137
2009-01-28  12.257423  10.52477  174.161139  14.642574
2009-01-29  12.101278   9.62514  171.488809  14.277321
2009-01-30  11.727830   9.18983  169.096191  13.879601
2009-02-02  11.907397   9.00603  170.115172  14.472122
2009-02-03  12.098675   9.45101  170.055239  15.015943
2009-02-04  12.172844   9.47036  171.328962  15.121459
2009-02-05  12.551497   9.12212  176.683613  15.454246
2009-02-06  12.975692   9.15114  185.454867  15.957483
2009-02-09  13.338731   9.32526  189.196135  15.778915
2009-02-10  12.729764   8.86093  179.076231  15.259444
2009-02-11  12.598341   8.72550  178.841472  15.592229
2009-02-12  12.917138   8.87060  181.343964  15.632814
2009-02-13  12.902825   8.82224  178.661643  15.494829
...               ...       ...         ...        ...
2012-04-23  74.390324  15.57434  298.502008  28.145776
2012-04-24  72.904343  15.65173  300.335186  27.970523
2012-04-25  79.373975  15.88390  304.555978  28.215879
2012-04-26  79.074692  15.99030  307.428105  28.137015
2012-04-27  78.463126  15.90324  307.183354  28.023099
2012-04-30  75.988215  15.83553  302.123410  28.058150
2012-05-01  75.747494  15.86455  301.913607  28.049386
2012-05-02  76.248456  15.64689  303.327209  27.865370
2012-05-03  75.707153  15.70010  305.205309  27.830320
2012-05-04  73.551045  15.29381  298.187334  27.146829
2012-05-07  74.101459  15.30348  303.472045  26.857660
2012-05-08  73.932300  15.19708  306.089446  26.726220
2012-05-09  74.062425  15.15838  304.271262  26.954051
2012-05-10  74.236781  15.04230  306.524016  26.936525
2012-05-11  73.741023  14.91654  302.313200  27.304558
2012-05-14  72.636291  14.93589  301.698816  26.883949
2012-05-15  71.979179  14.83916  305.250263  26.645803
2012-05-16  71.056621  14.52477  314.151389  26.372378
2012-05-17  68.979886  14.45222  311.214326  26.213614
2012-05-18  69.013715  14.25875  299.900615  25.816707
2012-05-21  73.034461  14.48124  306.748784  26.240075
2012-05-22  72.473644  14.58765  300.100412  26.248896
2012-05-23  74.241986  12.08221  304.426106  25.675584
2012-05-24  73.560156  12.04351  301.528978  25.640302
2012-05-25  73.165884  12.05319  295.470050  25.631482
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.464493  12.24666  296.873645  26.072491
2012-05-30  75.362333  12.14992  293.821674  25.878448
2012-05-31  75.174961  11.92743  290.140354  25.746145
2012-06-01  72.996726  11.67592  285.205295  25.093451

[868 rows x 4 columns]

In [287]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   72.996726
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.093451

In [288]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  72.473644  14.58765  300.100412  26.248896
2012-05-23  74.241986  12.08221  304.426106  25.675584
2012-05-24  73.560156  12.04351  301.528978  25.640302
2012-05-25  73.165884  12.05319  295.470050  25.631482
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.464493  12.24666  296.873645  26.072491
2012-05-30  75.362333  12.14992  293.821674  25.878448
2012-05-31  75.174961  11.92743  290.140354  25.746145
2012-06-01  72.996726  11.67592  285.205295  25.093451

In [289]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [290]:
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.362333
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.878448
2012-05-31 AAPL    75.174961
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.746145
2012-06-01 AAPL    72.996726
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.093451

In [291]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT